danger_skill = {  # e11s
    22060,  # 燃烧击
    22062,  # 燃烧击
    22064,  # 燃烧击
    22083,  # 燃烧击
    22085,  # 燃烧击
    22098,  # 燃烧击
    22100,  # 燃烧击
    22102,  # 燃烧击
    22137,  # 燃烧击
    22139,  # 燃烧击
    22141,  # 燃烧击
    22158,  # 燃烧击
    22165,  # 燃烧击
    22173,  # 燃烧击
    22063,  # 雷燃爆
    22086,  # 雷燃爆
    22101,  # 雷燃爆
    22140,  # 雷燃爆
    22166,  # 雷燃爆
    22065,  # 光明之刃
    22103,  # 光明之刃
    22142,  # 光明之刃
    22174,  # 光明之刃
    22128,  # 闪光
    22129,  # 闪光
    22093,  # 魔乱流
    22152,  # 魔乱流
    22078,  # 爆破领域
    22097,  # 爆破领域
    22131,  # 爆破领域
    22132,  # 爆破领域
    22181,  # 爆破领域
    22075,  # 光炎
    22076,  # 光炎
    22124,  # 光炎
    22125,  # 光炎
}

skill_alone = {
    22115,  # 元素破
    22116,  # 元素破
    22118,  # 元素破
    22120,  # 元素破
    22155,  # 元素破
    22156,  # 元素破
    22163,  # 元素破
    22171,  # 元素破
    22071,  # 罪光
    22113,  # 罪光
    22176,  # 罪光
    23495,  # 罪光
}

skill_together = {
    22121: 2,  # 罪光
    22172: 2,  # 罪光
    22067: 2,  # 罪炎
    22106: 2,  # 罪炎
    22117: 2,  # 罪炎
    22145: 2,  # 罪炎
    22157: 2,  # 罪炎
    22161: 2,  # 罪炎
}
