party_cover_skills = {
    133,  # 医济
    131,  # 愈疗
    124,  # 医治
    7433,  # 全大敕
    16534,  # 群花
    803,  # 低语
    16550,  # 大低语
    16551,  # 大幻光
    16547,  # 慰藉
    805,  # 幻光
    16544,  # 祥光
    186,  # 士气高扬
    3600,  # 阳星
    3601,  # 阳星相位
    16552,  # 占卜
    16553,  # 天星冲日
    16557,  # 天宫图
    16012,  # 桑巴
    16889,  # 策动
    7405,  # 行吟
    16004,  # 大舞
    16160,  # 光之心
    7388,  # 摆脱
    16471,  # 布道
    7459,  # 灵护
}

party_cover_skills_except_source = {
    118,  # 战斗之声
    3559,  # 放浪神
    114,  # 贤者
    116,  # 军神
}

danger_skill = {
    1550,  # 飞翎雨 - 极风神
    11085,  # 飞翎雨 - 绝神兵
}

swift_res_jobs = {
    24,  # whm
    27,  # smn
    28,  # sch
    33,  # ast
    35,  # rdm
}
